jliphard/wearable_nRF52_Firmware/ics43434.c
/* Copyright (c) 2017, Stanford University
 * All rights reserved.
 * 
 * The point of contact for the MENTAID wearables dev team is 
 * Jan Liphardt (jan.liphardt@stanford.edu)
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of STANFORD UNIVERSITY nor the names of its contributors 
 *    may be used to endorse or promote products derived from this software 
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY STANFORD UNIVERSITY "AS IS" AND ANY EXPRESS 
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES 
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL STANFORD UNIVERSITY OR ITS CONTRIBUTORS BE 
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR 
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE 
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) 
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT 
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT 
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * Parts of this software, primarily the basic BLE control code, were derived or 
 * directly copied from the Nordic reference implementations available in their SDK.  
 * For those sections, the following license applies:
 * 
 * Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <string.h>

#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "math.h"
#include "boards.h"
#include "app_timer.h"
#include "nrf_drv_clock.h"
#include "nrf_delay.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "app_pwm.h"
#include "nrf_drv_i2s.h"
#include "ics43434.h"
#include "SEGGER_RTT.h"

#define I2S_BUFFER_SIZE     64          // Data handler is called when I2S data bufffer contains (I2S_BUFFER_SIZE/2) 32bit words
#define RINGBUFFER_SIZE     8192        // Size in bytes of ringbuffer between I2S and UART

static uint32_t          m_buffer_rx[I2S_BUFFER_SIZE];
static uint32_t          lsample_buffer_rx[(I2S_BUFFER_SIZE/2)];
static volatile uint8_t  lsample_byte_buffer_rx[(I2S_BUFFER_SIZE*2)];
static volatile uint8_t  ringbuffer[RINGBUFFER_SIZE];
static volatile uint32_t i2s_write = 0;             // Ring buffer write pointer
static volatile uint32_t i2s_read  = 0;             // Ring buffer read pointer
static bool              m_error_encountered;       // I2S data callback error status
static volatile bool     ready_flag;                // A PWM ready status

union
{
  uint32_t word;
  uint8_t  byte_decomp[4];
}u;

void pwm_ready_callback(uint32_t pwm_id) // PWM ready callback function
{
	ready_flag = true;
}

static bool copy_samples(uint32_t const * p_buffer, uint16_t number_of_words) // I2S data callback read and ring buffer write function
{
    uint32_t count, size, offset = 0;

    memcpy(lsample_buffer_rx, p_buffer, (4*number_of_words)); // Copy I2S data from the callback buffer to a volatile buffer
	
    // Parse I2S callback data and load into a byte array
    for(uint32_t i=0; i<number_of_words; i++) {
        u.word = lsample_buffer_rx[i];
        for(uint8_t j=0; j<4; j++) {
            lsample_byte_buffer_rx[((4*i) + j)] = u.byte_decomp[3-j];
        }
    }
    
    SEGGER_RTT_printf(0, "%d %d %d %d\r\n", lsample_byte_buffer_rx[0], lsample_byte_buffer_rx[1], lsample_byte_buffer_rx[2] ,lsample_byte_buffer_rx[3]);
    
    // Load I2S byte array into the ring buffer and index write pointer
    count = (4*number_of_words);
    
    size = count;
    
    if((i2s_write + count) > RINGBUFFER_SIZE) {  // IF I2S byte count is larger than the space before pointer wrap, break into two pieces
      count = RINGBUFFER_SIZE - i2s_write;
    }
    
    if(count) {
        for(uint32_t i=0; i<count; i++) {
            ringbuffer[i2s_write + i] = lsample_byte_buffer_rx[i];
	}
        i2s_write += count;
        size -= count;
	offset = count;
        if(i2s_write == RINGBUFFER_SIZE) {  // Wrap the write pointer
            i2s_write = 0;
        }
    }
    
    count = size;
    
    if(count) { // If broken into two parts, do the second part 
        
        for(uint32_t i=0; i<count; i++) {
            ringbuffer[i2s_write + i] = lsample_byte_buffer_rx[offset + i];
        }
        
        i2s_write += count;
        
        if(i2s_write == RINGBUFFER_SIZE) {
            i2s_write = 0;
        }
    }
	  
    return true;
}

static void check_rx_data(uint32_t const * p_buffer, uint16_t number_of_words)
{
    if (!m_error_encountered)
    {
        m_error_encountered = !copy_samples(p_buffer, number_of_words);
    }
}

// This is the I2S data handler - all data exchange related to the I2S transfers is done here.
static void data_handler(uint32_t const * p_data_received,
                         uint32_t       * p_data_to_send,
                         uint16_t         number_of_words)
{
    // Non-NULL value in 'p_data_received' indicates that a new portion of
    // data has been received and should be processed.
    if (p_data_received != NULL)
    {
        check_rx_data(p_data_received, number_of_words);
    }

    // Non-NULL value in 'p_data_to_send' indicates that the driver needs
    // a new portion of data to send. Nothing done here; RX only...
    if (p_data_to_send != NULL)
    {
    }
}


void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
    #ifdef DEBUG
    app_error_print(id, pc, info);
    #endif

    while (1);
}

APP_PWM_INSTANCE(PWM1,1); // Create the instance "PWM1" using TIMER1.
APP_PWM_INSTANCE(PWM2,2); // Create the instance "PWM2" using TIMER2.

void ICS_Turn_On( void ) 
{
    //Digital mic
    //Define the I2S configuration; running in slave mode and using PWM outputs to provide synthetic SCK and LRCK
    ret_code_t err_code;
    
    nrf_drv_i2s_config_t config = NRF_DRV_I2S_DEFAULT_CONFIG;
    config.sdin_pin             = I2S_SDIN_PIN;
    config.sdout_pin            = I2S_SDOUT_PIN;
    config.mode                 = NRF_I2S_MODE_SLAVE;
    config.mck_setup            = NRF_I2S_MCK_DISABLED;
    config.sample_width         = NRF_I2S_SWIDTH_24BIT;
    config.channels             = NRF_I2S_CHANNELS_LEFT;                                                    // Set the I2S microphone to output on the left channel
    config.format               = NRF_I2S_FORMAT_I2S;
    err_code                    = nrf_drv_i2s_init(&config, data_handler);                                  // Initialize the I2S driver
    
    APP_ERROR_CHECK(err_code);
	
    // 1-channel PWM; 16MHz clock and period set in ticks.
    // The user is responsible for selecting the periods to give the correct ratio for the I2S frame length
    
    app_pwm_config_t pwm1_cfg = APP_PWM_DEFAULT_CONFIG_1CH(  25L, PWM_I2S_SCK_PIN);                         // SCK; pick a convenient gpio pin
    app_pwm_config_t pwm2_cfg = APP_PWM_DEFAULT_CONFIG_1CH(1600L, PWM_I2S_WS_PIN );                         // LRCK; pick a convenient gpio pin. LRCK period = 64X SCK period

    // Initialize and enable PWM's
    
    err_code = app_pwm_ticks_init(&PWM1,&pwm1_cfg,pwm_ready_callback);
    APP_ERROR_CHECK(err_code);
    
    err_code = app_pwm_ticks_init(&PWM2,&pwm2_cfg,pwm_ready_callback);
    APP_ERROR_CHECK(err_code);
    
    app_pwm_enable(&PWM1);
    app_pwm_enable(&PWM2);
    
    app_pwm_channel_duty_set(&PWM1, 0, 50);                                                                // Set at 50% duty cycle for square wave
    app_pwm_channel_duty_set(&PWM2, 0, 50);
    
    // Instantiate I2S
    err_code = nrf_drv_i2s_start(m_buffer_rx, NULL, I2S_BUFFER_SIZE, 0);                                   // RX only; "NULL" XMIT buffer
       
    APP_ERROR_CHECK(err_code);
    
    memset(m_buffer_rx, 0xCC, sizeof(m_buffer_rx));                                                        // Initialize I2S data callback buffer    
}